## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     RESOURCE                      |
|--------|---------------------------------------------------|
| add    | `aws_ecs_task_definition.superset_upgrade`        |
| update | `module.superset_ecs.aws_ecs_service.this`        |
|        | `module.superset_ecs.aws_iam_policy.this_task[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_task_definition.superset_upgrade will be created
  + resource "aws_ecs_task_definition" "superset_upgrade" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "/app/docker/docker-bootstrap.sh",
                      + "upgrade",
                    ]
                  + cpu              = 1024
                  + environment      = [
                      + {
                          + name  = "REDIS_HOST"
                          + value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_PORT"
                          + value = "6379"
                        },
                      + {
                          + name  = "SUPERSET_DATABASE_DB"
                          + value = "superset"
                        },
                    ]
                  + essential        = true
                  + image            = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/superset/superset"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "upgrade"
                        }
                    }
                  + memory           = 2048
                  + name             = "superset-upgrade"
                  + portMappings     = [
                      + {
                          + containerPort = 8088
                          + hostPort      = 8088
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "SUPERSET_DATABASE_HOST"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      + {
                          + name      = "SUPERSET_DATABASE_USER"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      + {
                          + name      = "SUPERSET_DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      + {
                          + name      = "SUPERSET_SECRET_KEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::066023111852:role/superset_ecs_task_exec_role"
      + family                   = "superset-upgrade"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::066023111852:role/superset_ecs_task_role"

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      ~ enable_execute_command             = true -> false
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_iam_policy.this_task[0] will be updated in-place
  ~ resource "aws_iam_policy" "this_task" {
        id        = "arn:aws:iam::066023111852:policy/superset_ecs_task_policy"
        name      = "superset_ecs_task_policy"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "sts:AssumeRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::066023111852:role/SupersetAthenaRead"
                        Sid      = "AssumeRoles"
                    },
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CreateSSMTunnel"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
